In [1]:
# Load packages
import pandas as pd
import numpy as np
from sqlalchemy import create_engine

In [4]:
# Create an engine and establish the connection
conn_url = 'postgresql://postgres:pwd4APAN5310@localhost/zillow'
engine = create_engine(conn_url)
connection = engine.connect()

In [5]:
# Pass table creation queries and execute
stmt = """
CREATE TABLE value (
    parcel_id              INT,
    value_total            NUMERIC(12,2),
    value_structure        NUMERIC(12,2),
    value_land             NUMERIC(12,2),
    tax_assessment_year    INT,
    tax_assessment         NUMERIC(12,2),
    PRIMARY KEY (parcel_id)
);

CREATE TABLE size (
    size_id             INT,
    total_living_sqft   NUMERIC(10,2),
    garage_sqft         NUMERIC(10,2),
    lot_sqft            NUMERIC(10,2),
    PRIMARY KEY(size_id)
);

CREATE TABLE room_count (
    room_count_id              INT,
    bathroom_count             NUMERIC(5,1),
    bedroom_count              NUMERIC(5,1),
    calculated_bath_number     NUMERIC(5,1),
    three_quarter_bath_number  NUMERIC(5,1),
    full_bath_count            NUMERIC(5,1),
    garage_count               NUMERIC(5,1),
    pool_count                 NUMERIC(5,1),
    room_count                 NUMERIC(5,1),
    unit_count                 INT,
    PRIMARY KEY (room_count_id)
);

CREATE TABLE property_land_use_type (
    parcel_id                      INT,
    property_land_use_type_id      INT,
    property_land_use_desc         VARCHAR(100),
    property_zoning_desc           VARCHAR(100),
    property_county_land_use_code  VARCHAR(100),
    PRIMARY KEY (Parcel_id,property_land_use_type_id),
    FOREIGN KEY (parcel_id) REFERENCES value(parcel_id)
);

CREATE TABLE floor (
    floor_type_id           INT,
    floor_type_desc         VARCHAR(100),
    PRIMARY KEY (floor_type_id)
);

CREATE TABLE heating_system (
    heating_system_type_id         INT,
    heating_system_desc            VARCHAR(100),
    PRIMARY KEY (heating_system_type_id)
);

CREATE TABLE air_conditioning(
    air_conditioning_type_id  INT,
    air_conditioning_desc  VARCHAR(100),
    PRIMARY KEY (air_conditioning_type_id)
);

CREATE TABLE architectural_style(
    architectural_style_type_id  INT,
    architectural_style_desc  VARCHAR(100),
    PRIMARY KEY (architectural_style_type_id)
);

CREATE TABLE location(
    location_id  VARCHAR(5),
    fips  INT,
    latitude  VARCHAR(20),
    longitude  VARCHAR(20),
    PRIMARY KEY (location_id)
);

CREATE TABLE region (
    region_id                  VARCHAR(5),
    region_id_county           INT,
    region_id_city             INT,
    region_id_zip              INT,
    region_id_neighborhood     INT,
    raw_census_tract_and_block NUMERIC(20,2),
    census_tract_and_block     NUMERIC(20,2),
    PRIMARY KEY (region_id)
);

CREATE TABLE home_info (
    parcel_id                       INT,
    building_quality_assessment     INT,
    year_built                      VARCHAR(10),
    size_id                         INT,
    room_count_id                   INT,
    heating_system_type_id          INT,
    air_conditioning_type_id        INT,
    architectural_style_type_id     INT,
    location_id                     VARCHAR(5),
    region_id                       VARCHAR(5),
    floor_type_id                   INT,
    PRIMARY KEY (parcel_id, building_quality_assessment),
    FOREIGN KEY (parcel_id) REFERENCES value(parcel_id),
    FOREIGN KEY (size_id) REFERENCES size(size_id),
    FOREIGN KEY (room_count_id) REFERENCES room_count(room_count_id),
    FOREIGN KEY (heating_system_type_id) REFERENCES heating_system(heating_system_type_id),
    FOREIGN KEY (air_conditioning_type_id) REFERENCES air_conditioning(air_conditioning_type_id),
    FOREIGN KEY (architectural_style_type_id) REFERENCES architectural_style (architectural_style_type_id),
    FOREIGN KEY (location_id) REFERENCES location(location_id),
    FOREIGN KEY (region_id) REFERENCES region(region_id),
    FOREIGN KEY (floor_type_id) REFERENCES floor(floor_type_id)

);

"""
connection.execute(stmt)

In [6]:
# Load the properties_2017_small data to dataframe
#df = pd.read_csv('properties_2017_small.csv')
df = pd.read_csv('sample.csv')
df.head()

,Unnamed: 0,parcelid,airconditioningtypeid,architecturalstyletypeid,basementsqft,bathroomcnt,bedroomcnt,buildingclasstypeid,buildingqualitytypeid,calculatedbathnbr,...,taxvaluedollarcnt,assessmentyear,landtaxvaluedollarcnt,taxamount,taxdelinquencyflag,taxdelinquencyyear,censustractandblock,property_land_use_type_desc,heating_system_desc,floor_type_desc
0,541116,11554200,NaN,NaN,NaN,3.0,3,NaN,6.0,3.0,...,126910.0,2016,77643.0,1674.89,NaN,NaN,6.037270e+13,Single Family Residential,Floor/Wall,0
1,1704087,11414286,NaN,NaN,NaN,3.0,4,NaN,3.0,3.0,...,158299.0,2016,57189.0,2455.22,NaN,NaN,6.037600e+13,"Triplex (3 Units, Any Combination)",0,0
2,644001,11067227,1.0,NaN,NaN,4.0,4,NaN,7.0,4.0,...,869520.0,2016,348551.0,10650.37,NaN,NaN,6.037110e+13,Planned Unit Development,Central,0
3,1338306,14000816,NaN,NaN,NaN,2.0,3,NaN,NaN,2.0,...,76429.0,2016,26171.0,1423.76,NaN,NaN,6.059110e+13,Single Family Residential,0,0
4,943769,11580959,NaN,NaN,NaN,4.0,5,NaN,9.0,4.0,...,2420602.0,2016,1455257.0,28202.05,NaN,NaN,6.037700e+13,Single Family Residential,Central,0

In [7]:
# TABLE 1
# value (parcel_id,value_total,value_structure,value_land,tax_assessment_year,tax_assessment)

# Step 1: Extract the related columns from the dataset
value = df[['parcelid','taxvaluedollarcnt','structuretaxvaluedollarcnt','landtaxvaluedollarcnt',
           'assessmentyear','taxamount']]

# Step 2: Rename the column names and check the table by head()
value.columns = ['parcel_id','value_total','value_structure','value_land','tax_assessment_year','tax_assessment']
value.head()

,parcel_id,value_total,value_structure,value_land,tax_assessment_year,tax_assessment
0,11554200,126910.0,49267.0,77643.0,2016,1674.89
1,11414286,158299.0,101110.0,57189.0,2016,2455.22
2,11067227,869520.0,520969.0,348551.0,2016,10650.37
3,14000816,76429.0,50258.0,26171.0,2016,1423.76
4,11580959,2420602.0,965345.0,1455257.0,2016,28202.05

In [8]:
# Write into the value table in the database
value.to_sql(name="value", con=engine, if_exists='append', index=False)

In [9]:
# TABLE 2
# size (size_id, total_living_sqft, garage_sqft, lot_sqft)

# Step 1: Extract the related columns from the dataset
size = df[['calculatedfinishedsquarefeet','garagetotalsqft','lotsizesquarefeet']]

# Step 2: Rename the column names, insert the id column and then check the final table by head()
size.columns = ['total_living_sqft','garage_sqft','lot_sqft']
size.insert(0,'size_id',range(1,1+len(size)))
size.head()

   size_id  total_living_sqft  garage_sqft  lot_sqft
0        1             2133.0          NaN    8230.0
1        2             1883.0          NaN    6018.0
2        3             4018.0          NaN   11001.0
3        4             1334.0        483.0    6500.0
4        5             4731.0          NaN    8211.0

In [10]:
# Write into the size table in the database
size.to_sql(name="size", con=engine, if_exists='append', index=False)

In [12]:
# TABLE 3
# room_count (room_count_id,bathroom_count,bedroom_count,calculated_bath_number,three_quarter_bath_number,
# full_bath_count,garage_count,pool_count,room_count,unit_count)

# Step 1: Extract the related columns from the dataset
room_count = df[['bathroomcnt','bedroomcnt', 'calculatedbathnbr', 'threequarterbathnbr', 'fullbathcnt',
                 'garagecarcnt', 'poolcnt', 'roomcnt', 'unitcnt']]

# Step 2: Rename the column names, insert the id column and then check the final table by head()
room_count.columns = ['bathroom_count','bedroom_count','calculated_bath_number','three_quarter_bath_number',
                      'full_bath_count','garage_count','pool_count','room_count','unit_count']
room_count.insert(0,'room_count_id',range(1,1+len(room_count)))
room_count.head()

,room_count_id,bathroom_count,bedroom_count,calculated_bath_number,three_quarter_bath_number,full_bath_count,garage_count,pool_count,room_count,unit_count
0,1,3.0,3,3.0,NaN,3.0,NaN,NaN,0,1.0
1,2,3.0,4,3.0,NaN,3.0,NaN,NaN,0,3.0
2,3,4.0,4,4.0,NaN,4.0,NaN,NaN,0,1.0
3,4,2.0,3,2.0,NaN,2.0,2.0,1.0,6,NaN
4,5,4.0,5,4.0,NaN,4.0,NaN,1.0,0,1.0

In [13]:
# Write into the size table in the database
room_count.to_sql(name="room_count", con=engine, if_exists='append', index=False)

In [14]:
# TABLE 4
# property_land_use_type table
# Step 1: Extract the related columns from the dataset
property_land_use_type = df[['parcelid','propertylandusetypeid','property_land_use_type_desc','propertyzoningdesc',
           'propertycountylandusecode']]

# Step 2: Rename the column names and check the table by head()
property_land_use_type.columns = ['parcel_id','property_land_use_type_id','property_land_use_desc','property_zoning_desc','property_county_land_use_code']
property_land_use_type.head()

,parcel_id,property_land_use_type_id,property_land_use_desc,property_zoning_desc,property_county_land_use_code
0,11554200,261,Single Family Residential,LAR1,100
1,11414286,247,"Triplex (3 Units, Any Combination)",INR2YY,300
2,11067227,269,Planned Unit Development,LARE11,010D
3,14000816,261,Single Family Residential,NaN,122
4,11580959,261,Single Family Residential,SMR1*,101

In [15]:
# Write into the value table in the database
property_land_use_type.to_sql(name="property_land_use_type", con=engine, if_exists='append', index=False)

In [16]:
# TABLE 5
# floor table
# Step 1: Extract the related columns from the dataset
floor = pd.read_csv('floor.csv')

# Step 2: Rename the column names and check the table by head()
floor.columns = ['floor_type_id','floor_type_desc']
floor.head()

   floor_type_id                 floor_type_desc
0              1                Attic & Basement
1              2                           Attic
2              3  Bi-Level with Attic & Basement
3              4                        Bi-Level
4              5             Bi-Level with Attic

In [17]:
# Write into the value table in the database
floor.to_sql(name="floor", con=engine, if_exists='append', index=False)

In [18]:
# TABLE 6
# heating_system table
# Step 1: Extract the related columns from the dataset
heating_system = pd.read_csv('heating.csv')
# Step 2: Rename the column names and check the table by head()
heating_system.columns = ['heating_system_type_id','heating_system_desc']
heating_system.head()

   heating_system_type_id heating_system_desc
0                       1           Baseboard
1                       2             Central
2                       3                Coal
3                       4          Convection
4                       5            Electric

In [19]:
# Write into the value table in the database
heating_system.to_sql(name="heating_system", con=engine, if_exists='append', index=False)

In [20]:
# TABLE 7
# air_conditioning table
# Step 1: Extract the related columns from the dataset
air_conditioning = pd.read_csv('air_conditioning.csv')

# Step 2: Rename the column names and check the table by head()
air_conditioning.columns = ['air_conditioning_type_id','air_conditioning_desc']
air_conditioning.head()

   air_conditioning_type_id air_conditioning_desc
0                         1               Central
1                         2         Chilled Water
2                         3    Evaporative Cooler
3                         4           Geo Thermal
4                         5                  None

In [21]:
# Write into the value table in the database
air_conditioning.to_sql(name="air_conditioning", con=engine, if_exists='append', index=False)

In [22]:
# TABLE 8
# architectural_style
# Step 1: Extract the related columns from the dataset
architectural_style = pd.read_csv('architectural_style.csv')

# Step 2: Rename the column names and check the table by head()
architectural_style.columns = ['architectural_style_type_id','architectural_style_desc']
architectural_style.head()

   architectural_style_type_id architectural_style_desc
0                            1                  A-Frame
1                            2                 Bungalow
2                            3                 Cape Cod
3                            4                  Cottage
4                            5                 Colonial

In [23]:
# Write into the value table in the database
architectural_style.to_sql(name="architectural_style", con=engine, if_exists='append', index=False)

In [24]:
# TABLE 9
# location (location_id, fips, latitude, longitude)

# Step 1: Extract the related columns from the dataset
location = df[['fips','latitude','longitude']]

# Step 2: Rename the column names, insert the id column and then check the final table by head()
location.columns = ['fips','latitude','longitude']
location.insert(0,'location_id',range(1,1+len(location)))
location.head()

   location_id  fips  latitude  longitude
0            1  6037  34006360 -118430214
1            2  6037  33937014 -118337661
2            3  6037  34288982 -118564947
3            4  6059  33781343 -118020520
4            5  6037  34032812 -118505242

In [25]:
# Write into the size table in the database
location.to_sql(name="location", con=engine, if_exists='append', index=False)

In [26]:
# TABLE 10
# region (region_id, region_id_county, region_id_city, region_id_zip, region_id_neighborhood, 
# raw_census_tract_and_block, census_tract_and_block)

# Step 1: Extract the related columns from the dataset
region = df[['regionidcounty','regionidcity','regionidzip', 'regionidneighborhood', 'rawcensustractandblock', 
             'censustractandblock']]

# Step 2: Rename the column names, insert the id column and then check the final table by head()
region.columns = ['region_id_county','region_id_city','region_id_zip', 'region_id_neighborhood', 
                  'raw_census_tract_and_block', 'census_tract_and_block']
region.insert(0,'region_id',range(1,1+len(region)))
region.head()

,region_id,region_id_county,region_id_city,region_id_zip,region_id_neighborhood,raw_census_tract_and_block,census_tract_and_block
0,1,3101,12447.0,96047.0,116415.0,60372719.02,6.037270e+13
1,2,3101,45888.0,96135.0,NaN,60376020.03,6.037600e+13
2,3,3101,12447.0,96356.0,275078.0,60371082.01,6.037110e+13
3,4,1286,24832.0,97052.0,NaN,60591100.03,6.059110e+13
4,5,3101,26964.0,96149.0,761547.0,60377013.04,6.037700e+13

In [27]:
# Write into the region table in the database
region.to_sql(name="region", con=engine, if_exists='append', index=False)

In [32]:
# TABLE 11
# home_info (parcel_id, building_quality_assessment, year_built, size_id, room_count_id, 
# heating_system_type_id, air_conditioning_type_id, architectural_style_type_id, location_id, region_id)

home_info = pd.DataFrame(columns=['parcel_id','building_quality_assessment','year_built', 'size_id', 'room_count_id', 
                                  'heating_system_type_id', 'air_conditioning_type_id', 'architectural_style_type_id', 
                                  'location_id', 'region_id'])
home_info['parcel_id'] = df[['parcelid']]
home_info['building_quality_assessment'] = df.iloc[:,0]
home_info['year_built'] = df[['yearbuilt']]
home_info['size_id'] = size[['size_id']]
home_info['room_count_id'] = room_count[['room_count_id']]

# work with heating system type column 
home_info['heating_system_type_id'] = df[['heating_system_desc']]
home_info = home_info.merge(heating_system, how='left', left_on='heating_system_type_id', 
                            right_on='heating_system_desc')
home_info = home_info.drop(columns=['heating_system_type_id_x', 'heating_system_desc'])
home_info.rename(columns={'heating_system_type_id_y':'heating_system_type_id'}, inplace=True)

# work with air conditioning system type column
home_info['air_conditioning_type_id'] = df[['airconditioningtypeid']]

# work with architectural style type column
home_info['architectural_style_type_id'] = df[['architecturalstyletypeid']]

# work with location id column
home_info['location_id'] = location[['location_id']]
home_info['region_id'] = region[['region_id']]

# work with floor id column
home_info['floor_type_id'] = floor[['floor_type_id']]


# check home_info dataframe
home_info.head()

,parcel_id,building_quality_assessment,year_built,size_id,room_count_id,air_conditioning_type_id,architectural_style_type_id,location_id,region_id,heating_system_type_id,floor_type_id
0,11554200,541116,1953.0,1,1,NaN,NaN,1,1,7.0,1.0
1,11414286,1704087,1932.0,2,2,NaN,NaN,2,2,NaN,2.0
2,11067227,644001,1997.0,3,3,1.0,NaN,3,3,2.0,3.0
3,14000816,1338306,1965.0,4,4,NaN,NaN,4,4,NaN,4.0
4,11580959,943769,1987.0,5,5,NaN,NaN,5,5,2.0,5.0

In [33]:
# Write into the home_info table in the database
home_info.to_sql(name="home_info", con=engine, if_exists='append', index=False)

In [ ]:
# End of the table creation process of the Zillow project.